{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "vgg16", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 3, 64, 64], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Convolution2D", "name": "block1_conv1", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block1_conv1", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "b_constraint": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block1_conv2", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block1_conv2", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 64, "b_constraint": null}, "inbound_nodes": [[["block1_conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "block1_pool", "config": {"dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block1_pool"}, "inbound_nodes": [[["block1_conv2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block2_conv1", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block2_conv1", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "b_constraint": null}, "inbound_nodes": [[["block1_pool", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block2_conv2", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block2_conv2", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 128, "b_constraint": null}, "inbound_nodes": [[["block2_conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "block2_pool", "config": {"dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block2_pool"}, "inbound_nodes": [[["block2_conv2", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block3_conv1", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block3_conv1", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 256, "b_constraint": null}, "inbound_nodes": [[["block2_pool", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block3_conv2", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block3_conv2", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 256, "b_constraint": null}, "inbound_nodes": [[["block3_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block3_conv3", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block3_conv3", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 256, "b_constraint": null}, "inbound_nodes": [[["block3_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "block3_pool", "config": {"dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block3_pool"}, "inbound_nodes": [[["block3_conv3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block4_conv1", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block4_conv1", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block3_pool", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block4_conv2", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block4_conv2", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block4_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block4_conv3", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block4_conv3", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block4_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "block4_pool", "config": {"dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block4_pool"}, "inbound_nodes": [[["block4_conv3", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block5_conv1", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block5_conv1", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block4_pool", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block5_conv2", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block5_conv2", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block5_conv1", 0, 0]]]}, {"class_name": "Convolution2D", "name": "block5_conv3", "config": {"W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "activation": "relu", "trainable": false, "bias": true, "nb_col": 3, "name": "block5_conv3", "activity_regularizer": null, "nb_row": 3, "dim_ordering": "th", "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same", "nb_filter": 512, "b_constraint": null}, "inbound_nodes": [[["block5_conv2", 0, 0]]]}, {"class_name": "MaxPooling2D", "name": "block5_pool", "config": {"dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "trainable": false, "strides": [2, 2], "name": "block5_pool"}, "inbound_nodes": [[["block5_conv3", 0, 0]]]}], "output_layers": [["block5_pool", 0, 0]]}, "keras_version": "1.2.0"}