{"keras_version": "1.2.0", "class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"input_dtype": "float32", "batch_input_shape": [null, 3, 64, 64], "name": "input_1", "sparse": false}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 64, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block1_conv1", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 64, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block1_conv2", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool", "config": {"dim_ordering": "th", "border_mode": "valid", "name": "block1_pool", "trainable": false, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 128, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block2_conv1", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 128, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block2_conv2", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool", "config": {"dim_ordering": "th", "border_mode": "valid", "name": "block2_pool", "trainable": false, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 256, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block3_conv1", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 256, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block3_conv2", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 256, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block3_conv3", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool", "config": {"dim_ordering": "th", "border_mode": "valid", "name": "block3_pool", "trainable": false, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block4_conv1", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block4_conv2", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block4_conv3", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool", "config": {"dim_ordering": "th", "border_mode": "valid", "name": "block4_pool", "trainable": false, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block5_conv1", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block5_conv2", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3", "config": {"nb_row": 3, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "nb_filter": 512, "activation": "relu", "b_constraint": null, "b_regularizer": null, "border_mode": "same", "bias": true, "init": "glorot_uniform", "trainable": false, "name": "block5_conv3", "W_regularizer": null, "nb_col": 3, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool", "config": {"dim_ordering": "th", "border_mode": "valid", "name": "block5_pool", "trainable": false, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten", "config": {"trainable": true, "name": "flatten"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0]]], "name": "fc1", "config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 2048.0, "init": "glorot_uniform", "input_dim": 2048, "trainable": true, "name": "fc1", "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0]]], "name": "fc2", "config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 2048.0, "init": "glorot_uniform", "input_dim": 2048.0, "trainable": true, "name": "fc2", "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0]]], "name": "predictions", "config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null, "b_regularizer": null, "output_dim": 5, "init": "glorot_uniform", "input_dim": 2048.0, "trainable": true, "name": "predictions", "W_regularizer": null, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["predictions", 0, 0]]}}